## Titanic Survival Prediction

In [1]:
import numpy as np, pandas as pd, matplotlib.pyplot as plt, seaborn as sns

In [2]:
gender_submission = pd.read_csv('gender_submission.csv')
test = pd.read_csv('test.csv')
train = pd.read_csv('train.csv')

In [3]:
gender_submission.head()

   PassengerId  Survived
0          892         0
1          893         1
2          894         0
3          895         0
4          896         1

In [4]:
gender_submission.shape

(418, 2)

In [5]:
test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [6]:
test.shape

(418, 11)

In [7]:
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [8]:
train.shape

(891, 12)

In [9]:
y_train = train['Survived']
train.drop('Survived', axis=1, inplace=True)

In [10]:
y_train.shape

(891,)

In [11]:
X_train = train
X_train.shape

(891, 11)

In [12]:
X_test = test

In [13]:
X_train.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [14]:
X_test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [15]:
X_train.drop(['Cabin', 'Ticket'], axis=1, inplace=True)
X_test.drop(['Cabin', 'Ticket'], axis=1, inplace=True)

In [16]:
X_train.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked
0,1,3,"Braund, Mr. Owen Harris",male,22.0,1,0,7.2500,S
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,71.2833,C
2,3,3,"Heikkinen, Miss. Laina",female,26.0,0,0,7.9250,S
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,53.1000,S
4,5,3,"Allen, Mr. William Henry",male,35.0,0,0,8.0500,S

In [17]:
one_hot_encoded_data = pd.get_dummies(X_train, columns = ['Embarked'])

In [18]:
X_train = one_hot_encoded_data

In [19]:
X_train.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked_C,Embarked_Q,Embarked_S
0,1,3,"Braund, Mr. Owen Harris",male,22.0,1,0,7.2500,0,0,1
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,71.2833,1,0,0
2,3,3,"Heikkinen, Miss. Laina",female,26.0,0,0,7.9250,0,0,1
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,53.1000,0,0,1
4,5,3,"Allen, Mr. William Henry",male,35.0,0,0,8.0500,0,0,1

In [20]:
X_train.shape

(891, 11)

In [21]:
X_train['Sex'].replace(['male', 'female'], [1, 0], inplace=True)

In [22]:
X_train.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked_C,Embarked_Q,Embarked_S
0,1,3,"Braund, Mr. Owen Harris",1,22.0,1,0,7.2500,0,0,1
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,38.0,1,0,71.2833,1,0,0
2,3,3,"Heikkinen, Miss. Laina",0,26.0,0,0,7.9250,0,0,1
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,35.0,1,0,53.1000,0,0,1
4,5,3,"Allen, Mr. William Henry",1,35.0,0,0,8.0500,0,0,1

In [23]:
X_train.shape

(891, 11)

In [24]:
X_test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,7.8292,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,7.0000,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,9.6875,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,8.6625,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,12.2875,S

In [25]:
one_hot_encoded_data = pd.get_dummies(X_test, columns = ['Embarked'])

In [26]:
X_test = one_hot_encoded_data

In [27]:
X_test['Sex'].replace(['male', 'female'], [1, 0], inplace=True)

In [28]:
X_test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked_C,Embarked_Q,Embarked_S
0,892,3,"Kelly, Mr. James",1,34.5,0,0,7.8292,0,1,0
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",0,47.0,1,0,7.0000,0,0,1
2,894,2,"Myles, Mr. Thomas Francis",1,62.0,0,0,9.6875,0,1,0
3,895,3,"Wirz, Mr. Albert",1,27.0,0,0,8.6625,0,0,1
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",0,22.0,1,1,12.2875,0,0,1

In [29]:
X_test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked_C,Embarked_Q,Embarked_S
0,892,3,"Kelly, Mr. James",1,34.5,0,0,7.8292,0,1,0
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",0,47.0,1,0,7.0000,0,0,1
2,894,2,"Myles, Mr. Thomas Francis",1,62.0,0,0,9.6875,0,1,0
3,895,3,"Wirz, Mr. Albert",1,27.0,0,0,8.6625,0,0,1
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",0,22.0,1,1,12.2875,0,0,1

In [30]:
X_train.drop('Name', axis=1, inplace=True)
X_test.drop('Name', axis=1, inplace=True)

In [31]:
X_train.isnull().sum()

PassengerId      0
Pclass           0
Sex              0
Age            177
SibSp            0
Parch            0
Fare             0
Embarked_C       0
Embarked_Q       0
Embarked_S       0
dtype: int64

In [32]:
X_test.isnull().sum()

PassengerId     0
Pclass          0
Sex             0
Age            86
SibSp           0
Parch           0
Fare            1
Embarked_C      0
Embarked_Q      0
Embarked_S      0
dtype: int64

In [33]:
for col in X_train.columns:
    print(col, '  -->  ', X_train[col].isnull().values.any())

PassengerId   -->   False
Pclass   -->   False
Sex   -->   False
Age   -->   True
SibSp   -->   False
Parch   -->   False
Fare   -->   False
Embarked_C   -->   False
Embarked_Q   -->   False
Embarked_S   -->   False

In [34]:
X_train['Age'].fillna(int(X_train['Age'].mean()), inplace=True)

In [35]:
for col in X_train.columns:
    print(col, '  -->  ', X_train[col].isnull().values.any())

PassengerId   -->   False
Pclass   -->   False
Sex   -->   False
Age   -->   False
SibSp   -->   False
Parch   -->   False
Fare   -->   False
Embarked_C   -->   False
Embarked_Q   -->   False
Embarked_S   -->   False

In [36]:
X_train['Age'] = X_train['Age'].apply(pd.to_numeric, downcast='integer')

In [37]:
X_train.shape

(891, 10)

In [38]:
X_test['Age'].fillna(int(X_test['Age'].mean()), inplace=True)

In [39]:
X_test['Age'] = X_test['Age'].apply(pd.to_numeric, downcast='integer')

In [40]:
X_test['Fare'].fillna(X_test['Fare'].mean(), inplace=True)

In [41]:
X_test.head()

,PassengerId,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked_C,Embarked_Q,Embarked_S
0,892,3,1,34.5,0,0,7.8292,0,1,0
1,893,3,0,47.0,1,0,7.0000,0,0,1
2,894,2,1,62.0,0,0,9.6875,0,1,0
3,895,3,1,27.0,0,0,8.6625,0,0,1
4,896,3,0,22.0,1,1,12.2875,0,0,1

In [42]:
X_test.isnull().sum()

PassengerId    0
Pclass         0
Sex            0
Age            0
SibSp          0
Parch          0
Fare           0
Embarked_C     0
Embarked_Q     0
Embarked_S     0
dtype: int64

In [43]:
X_test.shape

(418, 10)

In [44]:
X_train.shape

(891, 10)

In [45]:
from sklearn.linear_model import LogisticRegression
classifier = LogisticRegression(solver='liblinear', random_state = 42)
classifier.fit(X_train, y_train)

LogisticRegression(random_state=42, solver='liblinear')

In [46]:
y_pred = classifier.predict(X_test)

In [47]:
y_pred = pd.DataFrame(y_pred)

In [48]:
y_pred.shape

(418, 1)

In [49]:
y_pred.head()

   0
0  0
1  0
2  0
3  0
4  1

## Actual Data with different Algorithms

In [50]:
from sklearn.ensemble import RandomForestClassifier
from sklearn.svm import SVC
from sklearn.model_selection import train_test_split

In [51]:
rfMain = RandomForestClassifier(n_estimators=40)
rfMain.fit(X_train, y_train)
print("Accuracy using Random Forest = {}".format(np.round(rfMain.score(X_test, gender_submission['Survived'])*100, 2)))

Accuracy using Random Forest = 79.67

In [52]:
svmMain = SVC()
svmMain.fit(X_train, y_train)
print("Accuracy using SVM = {}".format(np.round(svmMain.score(X_test, gender_submission['Survived'])*100, 2)))

Accuracy using SVM = 64.83

In [53]:
lrMain = LogisticRegression(solver='liblinear')
lrMain.fit(X_train, y_train)
print("Accuracy using Logistic Regression = {}".format(np.round(lrMain.score(X_test, gender_submission['Survived'])*100, 2)))

Accuracy using Logistic Regression = 94.98

## Cross Valdiation Set

In [54]:
cX_train, cX_test, cy_train, cy_test = train_test_split(X_train, y_train, test_size = 0.25, random_state = 42)

In [55]:
lr = LogisticRegression(solver='liblinear')
lr.fit(cX_train, cy_train)
print("Accuracy using Logistic Regression = {}".format(np.round(lr.score(cX_test, cy_test)*100, 2)))

Accuracy using Logistic Regression = 79.37

In [56]:
svm = SVC()
svm.fit(cX_train, cy_train)
print("Accuracy using SVM = {}".format(np.round(svm.score(cX_test, cy_test)*100, 2)))

Accuracy using SVM = 61.88

In [57]:
rf = RandomForestClassifier(n_estimators=40)
rf.fit(cX_train, cy_train)
print("Accuracy using Random Forest = {}".format(np.round(rf.score(cX_test, cy_test)*100, 2)))

Accuracy using Random Forest = 82.51

## Conclusion: Logistic Regression works best with default parameters & Random Forest works best for cross validation sets